In [1]:
# 1、获取数据
import pandas
titanic_data = pandas.read_csv("http://biostat.mc.vanderbilt.edu/wiki/pub/Main/DataSets/titanic.txt")

In [2]:
titanic_data.head()

,row.names,pclass,survived,name,age,embarked,home.dest,room,ticket,boat,sex
0,1,1st,1,"Allen, Miss Elisabeth Walton",29.0000,Southampton,"St Louis, MO",B-5,24160 L221,2,female
1,2,1st,0,"Allison, Miss Helen Loraine",2.0000,Southampton,"Montreal, PQ / Chesterville, ON",C26,NaN,NaN,female
2,3,1st,0,"Allison, Mr Hudson Joshua Creighton",30.0000,Southampton,"Montreal, PQ / Chesterville, ON",C26,NaN,(135),male
3,4,1st,0,"Allison, Mrs Hudson J.C. (Bessie Waldo Daniels)",25.0000,Southampton,"Montreal, PQ / Chesterville, ON",C26,NaN,NaN,female
4,5,1st,1,"Allison, Master Hudson Trevor",0.9167,Southampton,"Montreal, PQ / Chesterville, ON",C22,NaN,11,male

In [4]:
# 筛选特征值和目标值
x = titanic_data[["age","pclass","sex"]]
y = titanic_data[["survived"]]

In [6]:
x.head()

       age pclass     sex
0  29.0000    1st  female
1   2.0000    1st  female
2  30.0000    1st    male
3  25.0000    1st  female
4   0.9167    1st    male

In [7]:
y.head()

   survived
0         1
1         0
2         0
3         0
4         1

In [9]:
# 数据处理
# 1）缺失值处理
x["age"].fillna(x["age"].mean(),inplace = True)
# 2)转换成字典
x = x.to_dict(orient="records")

D:\Program Files\Anaconda3\lib\site-packages\pandas\core\generic.py:6130: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self._update_inplace(new_data)

In [11]:
# 3、数据集划分
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test = train_test_split(x,y,random_state=22)

In [16]:
# 4、字典特征抽取
from sklearn.feature_extraction import DictVectorizer
from sklearn.tree import DecisionTreeClassifier
transfer = DictVectorizer()
x_train = transfer.fit_transform(x_train)
x_test = transfer.transform(x_test)

In [14]:
# 4、决策树估计器
tree = DecisionTreeClassifier(criterion="entropy")

In [17]:
tree.fit(x_train,y_train)

DecisionTreeClassifier(class_weight=None, criterion='entropy', max_depth=None,
                       max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort=False,
                       random_state=None, splitter='best')

In [27]:
# 5、模型评估
# 方法一：直接比对真实值和预估值
x_predict = tree.predict(x_test)
# print("比对真实值和预估值:",  y_test == x_predict)
# y_test

In [28]:
# 方法二：计算准确率
score = tree.score(x_test,y_test)
print()